! Command: show running-config
! device: S1 (vEOS-lab, EOS-4.26.13M)
!
! boot system flash:/vEOS-lab.swi
!
no aaa root
!
transceiver qsfp default-mode 4x10G
!
service routing protocols model multi-agent
!
hostname S1
!
spanning-tree mode mstp
!
interface Ethernet1
   description S1 -> L1
   no switchport
   ip address 10.1.0.2/30
   ip ospf network point-to-point
   ip ospf area 0.0.0.0
!
interface Ethernet2
   description S1 -> L2
   mac-address 52:dc:ca:fe:05:02
   no switchport
   ip address 10.1.0.10/30
   ip ospf network point-to-point
   ip ospf area 0.0.0.0
!
interface Ethernet3
   description S1 -> L3
   mac-address 52:dc:ca:fe:05:03
   no switchport
   ip address 10.1.0.18/30
   ip ospf network point-to-point
   ip ospf area 0.0.0.0
!
interface Ethernet4
   description S1 -> L4
   mac-address 52:dc:ca:fe:05:04
   no switchport
   ip address 10.1.0.26/30
   ip ospf network point-to-point
   ip ospf area 0.0.0.0
!
interface Ethernet5
!
interface Ethernet6
!
interface Ethernet7
!
interface Ethernet8
!
interface Ethernet9
!
interface Ethernet10
!
interface Ethernet11
!
interface Ethernet12
!
interface Loopback0
   ip address 10.0.0.5/32
   ip ospf area 0.0.0.0
!
interface Management1
!
ip routing
!
router ospf 1
   router-id 10.0.0.5
   max-lsa 12000
!
end
S1#wr
Copy completed successfully.
S1#show ip ospf neighbor
Neighbor ID     Instance VRF      Pri State                  Dead Time   Address         Interface
S1#show ip ospf neighbor
Neighbor ID     Instance VRF      Pri State                  Dead Time   Address         Interface
10.0.0.1        1        default  0   FULL                   00:00:33    10.1.0.1        Ethernet1
10.0.0.2        1        default  0   FULL                   00:00:32    10.1.0.9        Ethernet2
10.0.0.3        1        default  0   FULL                   00:00:29    10.1.0.17       Ethernet3
10.0.0.4        1        default  0   FULL                   00:00:33    10.1.0.25       Ethernet4
S1#show run
! Command: show running-config
! device: S1 (vEOS-lab, EOS-4.26.13M)
!
! boot system flash:/vEOS-lab.swi
!
no aaa root
!
transceiver qsfp default-mode 4x10G
!
service routing protocols model multi-agent
!
hostname S1
!
spanning-tree mode mstp
!
interface Ethernet1
   description S1 -> L1
   no switchport
   ip address 10.1.0.2/30
   ip ospf network point-to-point
   ip ospf area 0.0.0.0
!
interface Ethernet2
   description S1 -> L2
   mac-address 52:dc:ca:fe:05:02
   no switchport
   ip address 10.1.0.10/30
   ip ospf network point-to-point
   ip ospf area 0.0.0.0
!
interface Ethernet3
   description S1 -> L3
   mac-address 52:dc:ca:fe:05:03
   no switchport
   ip address 10.1.0.18/30
   ip ospf network point-to-point
   ip ospf area 0.0.0.0
!
interface Ethernet4
   description S1 -> L4
   mac-address 52:dc:ca:fe:05:04
   no switchport
   ip address 10.1.0.26/30
   ip ospf network point-to-point
   ip ospf area 0.0.0.0
!
interface Ethernet5
!
interface Ethernet6
!
interface Ethernet7
!
interface Ethernet8
!
interface Ethernet9
!
interface Ethernet10
!
interface Ethernet11
!
interface Ethernet12
!
interface Loopback0
   ip address 10.0.0.5/32
   ip ospf area 0.0.0.0
!
interface Management1
!
ip routing
!
router ospf 1
   router-id 10.0.0.5
   max-lsa 12000
!
end
